
&ИзменениеИКонтроль("узОткрытьКанбанДоску")
Процедура kanban_узОткрытьКанбанДоску()
	Если узОбщийМодульСервер.узОткрыватьКанбанДоскуПриНачалеРаботыСистемы() Тогда
		#Удаление
		ОткрытьФорму("Обработка.узКанбанДоска.Форма.ФормаДинамическая");
		#КонецУдаления
		#Вставка
		Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("канбан_Доска") Тогда
			МодульКанбанДоска = ОбщегоНазначенияКлиент.ОбщийМодуль("канбан_КанбанДоскаКлиент");
			МодульКанбанДоска.ОткрытьКанбанДоску();
		Иначе
			ОткрытьФорму("Обработка.узКанбанДоска.Форма.ФормаДинамическая");
		КонецЕсли;
		#КонецВставки
	Конецесли;
КонецПроцедуры