// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Текст HTMLРедактора.
// 
// Параметры:
//  СтраницаHTMLРедактора - Строка - HTML страница редактора
//  УникальныйИдентификатор - УникальныйИдентификатор, Строка - гуид формы или адрес во временном хранилище.
//
Процедура ТекстHTMLРедактора(СтраницаHTMLРедактора, УникальныйИдентификатор) Экспорт
	
	ДвоичныеДанныеРедактора = ПолучитьМакет("РедакторЗадач");
	канбан_КанбанДоска.ЗагрузитьПриложение(ДвоичныеДанныеРедактора, СтраницаHTMLРедактора, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
