// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Используемые статусы.
// 
// Параметры:
//  ТекстЗапросаСтатусы - см. канбан_КанбанДоскаПереопределяемый.ТекстЗапросаСтатусы
//  ДанныеДляКанбанДоски - см. канбан_КанбанДоска.ДанныеДляКанбанДоски
//
Процедура Статусы(ТекстЗапросаСтатусы, ДанныеДляКанбанДоски) Экспорт
	
	Выборка = ДополнитьЗапросСтатусы(ТекстЗапросаСтатусы);
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаСтатусов = ДанныеДляКанбанДоски.Статусы.Добавить();
		СтрокаСтатусов.Статус = Выборка.Статус;
		СтрокаСтатусов.Представление = Выборка.Представление;
		СтрокаСтатусов.УникальныйИдентификатор = Выборка.УникальныйИдентификатор;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Дополнить запрос статусы.
// 
// Параметры:
//  ТекстЗапросаСтатусы - Строка - Текст запроса статусы
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
// * Статус - ОпределяемыйТип.канбан_СтатусыЗадач
// * Представление - Строка - представление статуса для канбан доски
// * УникальныйИдентификатор - Строка
//
Функция ДополнитьЗапросСтатусы(ТекстЗапросаСтатусы)
	
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапросаСтатусы);
	ПервыйПакет = СхемаЗапроса.ПакетЗапросов.Получить(0);
	Оператор = ПервыйПакет.Операторы[0];
	
	ТаблицаИспользуемыеСтатусыДоски = Оператор.Источники.Добавить(
		"РегистрСведений.канбан_ИспользуемыеСтатусыДоски", "ИспользуемыеСтатусыДоски");
	
	// Если к единственному источнику добавляется один источник, то соединение создается автоматически.
	ТаблицаИспользуемыеСтатусыДоски.Соединения[0].ТипСоединения = ТипСоединенияСхемыЗапроса.Внутреннее;
	
	ДоступноеПолеНомер = ТаблицаИспользуемыеСтатусыДоски.Источник.ДоступныеПоля.Найти("НомерПоПорядку");
	ПолеНомер = Оператор.ВыбираемыеПоля.Добавить(ДоступноеПолеНомер);
	
	ПервыйПакет.Порядок.Добавить(ПолеНомер);
	
	Запрос = Новый Запрос;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
