// @strict-types


#Область ПрограммныйИнтерфейс

// Открыть канбан доску
//
Процедура ОткрытьКанбанДоску() Экспорт
	ОткрытьФорму("Обработка.Канбан_Доска_HTML.Форма.Доска");
КонецПроцедуры

// Открыть страницу разработки.
Процедура ОткрытьСтраницуРазработки() Экспорт
	
	ЗапуститьПриложение("https://github.com/ViktorErmakov/Kanban_for_1C");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Открыть форму списка определяемого типа.
// 
// Параметры:
//  ИмяОпределяемогоТипа - Строка
//
Процедура ОткрытьФормуСпискаОпределяемогоТипа(ИмяОпределяемогоТипа) Экспорт
	
	ИмяФормы = канбан_КанбанДоскаВызовСервера.ИмяФормыСпискаОпределяемогоТипа(ИмяОпределяемогоТипа);
	
	Если Не ПустаяСтрока(ИмяФормы) Тогда
		ОткрытьФорму(ИмяФормы);
	КонецЕсли;
	
КонецПроцедуры

// События обработки оповещения.
// 
// Возвращаемое значение:
//  Массив из Строка
//
Функция СобытияОбработкиОповещения() Экспорт
	
	События = Новый Массив; // Массив из Строка
	События.Добавить("ОбновитьКанбанДоскуHTML");
	
	канбан_КанбанДоскаКлиентПереопределяемый.СобытияОбработкиОповещения(События);
	
	Возврат События;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
