// @strict-types


#Область СлужебныйПрограммныйИнтерфейс

// Данные для канбан доски.
// 
// Параметры:
//  ПараметрыОтбора - см. канбан_КанбанДоска.НовыйПараметрыОтбораЗадач
//  ДанныеДляКанбанДоски - см. канбан_КанбанДоска.НовыйДанныеДляКанбанДоски
//
Процедура ДанныеДляКанбанДоски(Знач ПараметрыОтбора, ДанныеДляКанбанДоски) Экспорт
	
	// Заполнение списка статусов для отображения на доске
	Статусы = ДанныеДляКанбанДоски.Статусы;
	
	// TODO временное получение запросом, в дальнейшем нужно сделать настройки для пользователей
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	узСтатусыЗадачи.Ссылка
		|ИЗ
		|	Справочник.узСтатусыЗадачи КАК узСтатусыЗадачи
		|ГДЕ
		|	НЕ узСтатусыЗадачи.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Статусы.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	// Заполнение списка задач
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	узЗадачи.Ссылка,
		|	узЗадачи.Статус
		|ИЗ
		|	Справочник.узЗадачи КАК узЗадачи
		|ГДЕ
		|	НЕ узЗадачи.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ДанныеДляКанбанДоски.ЗадачиИСтатусы.Добавить();
		НоваяСтрока.Задача = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.Статус = ВыборкаДетальныеЗаписи.Статус;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
