// @strict-types


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КанбанДоскаHTML = канбан_КанбанДоска.КанбанДоскаHTMLВключенаЗагрузить();
	
	// Вынести в отдельный метод, и переделать на 
	НаборЗаписей = РеквизитФормыВЗначение("СтатусыЗадач");
	НаборЗаписей.Прочитать();
	ЗначениеВРеквизитФормы(НаборЗаписей, "СтатусыЗадач");
	
	ИспользуемыеПроектыДоскиЗагрузить();
	
	АдресЛоготипа = БиблиотекаКартинок.канбан_Доска;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КанбанДоскаHTMLПриИзменении(Элемент)
	
	КанбанДоскаHTMLПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтатусыЗадач

&НаКлиенте
Процедура СтатусыЗадачПриИзменении(Элемент)
	
	Номер = 1;
	Для Каждого СтрокаСтатуса Из СтатусыЗадач Цикл
		СтрокаСтатуса.НомерПоПорядку = Номер;
		Номер = Номер + 1;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИспользуемыеПроектыДоски

&НаКлиенте
Процедура ИспользуемыеПроектыДоскиЦветНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ИспользуемыеПроектыДоскиЦветНачалоВыбораПродолжение();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьНаСервере();
	Оповестить("ОбновитьКанбанДоскуHTML");
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ЗаписатьНаСервере();
	Оповестить("ОбновитьКанбанДоскуHTML");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ГруппаСтатусыЗадач.ТолькоПросмотр = Не КанбанДоскаHTML;
	Элементы.ГруппаПроекты.ТолькоПросмотр = Не КанбанДоскаHTML;
	
КонецПроцедуры

&НаСервере
Процедура ИспользуемыеПроектыДоскиЗагрузить()
	
	ПроектыЗагруженные = канбан_КанбанДоска.ИспользуемыеПроектыДоскиЗагрузить();
	Если ЗначениеЗаполнено(ПроектыЗагруженные) Тогда
		
		ПроектыРеквизит = РеквизитФормыВЗначение("ИспользуемыеПроектыДоски");
		Для Каждого СтрокаПроектаЗагруженного Из ПроектыЗагруженные Цикл
			
			НоваяСтрокаПроектыРеквизит = ПроектыРеквизит.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПроектыРеквизит, СтрокаПроектаЗагруженного);
			
		КонецЦикла;
		ЗначениеВРеквизитФормы(ПроектыРеквизит, "ИспользуемыеПроектыДоски");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КанбанДоскаHTMLПриИзмененииНаСервере()
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	канбан_КанбанДоска.КанбанДоскаHTMLВключенаСохранить(КанбанДоскаHTML);
	ЗаписатьСтатусыЗадач();
	ЗаписатьИспользуемыеПроектыДоски();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСтатусыЗадач()
	
	Попытка
		
		НаборЗаписей = РеквизитФормыВЗначение("СтатусыЗадач");
		НаборЗаписей.Записать();
		Модифицированность = Ложь;
		
	Исключение
		
		ЗаписьЖурналаРегистрации(
			"Запись регистра сведений канбан_ИспользуемыеСтатусыДоски", 
			УровеньЖурналаРегистрации.Ошибка, , 
			"Не удалось записать набор записей", 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИспользуемыеПроектыДоски()
	
	Проекты = РеквизитФормыВЗначение("ИспользуемыеПроектыДоски");
	канбан_КанбанДоска.ИспользуемыеПроектыДоскиСохранить(Проекты);

КонецПроцедуры

&НаКлиенте
Асинх Процедура ИспользуемыеПроектыДоскиЦветНачалоВыбораПродолжение()
	
	ТекущиеДанные = Элементы.ИспользуемыеПроектыДоски.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыборЦвета = Новый ДиалогВыбораЦвета;
	Ждать ВыборЦвета.ВыбратьАсинх();
	
	АбсолютныйЦвет = ВыборЦвета.Цвет.ПолучитьАбсолютный();
	Красный = ?(АбсолютныйЦвет.Красный = 0, "0", АбсолютныйЦвет.Красный);
	Зеленый = ?(АбсолютныйЦвет.Зеленый = 0, "0", АбсолютныйЦвет.Зеленый);
	Синий = ?(АбсолютныйЦвет.Синий = 0, "0", АбсолютныйЦвет.Синий);
	
	ТекущиеДанные.Цвет = СтрШаблон("%1,%2,%3", Красный, Зеленый, Синий);
	
КонецПроцедуры

#КонецОбласти
