// @strict-types


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КанбанДоскаHTML = канбан_КанбанДоска.КанбанДоскаHTMLВключена();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КанбанДоскаHTMLПриИзменении(Элемент)
	
	КанбанДоскаHTMLПриИзмененииНаСервере(КанбанДоскаHTML);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура КанбанДоскаHTMLПриИзмененииНаСервере(Знач Значение)
	
	канбан_КанбанДоска.КанбанДоскаHTMLПриИзменении(Значение);
	
КонецПроцедуры

#КонецОбласти
