// @strict-types


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстHTMLКанбанДоски();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьКанбанДоскуHTML" Тогда
		
		ТекстHTMLКанбанДоски();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КанбанДоскаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(ДанныеСобытия.Button.className) 
		И СтрРазделить(ДанныеСобытия.Button.className, " ")[0] = "changeStatus" Тогда
			
			КанбанДоскаПриНажатииНаСервере(
				СтрЗаменить(ДанныеСобытия.Button.parentElement.id, "task", ""), 
				ДанныеСобытия.Button.parentElement.parentElement.id);
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ТекстHTMLКанбанДоски()
	
	КанбанДоска = канбан_КанбанДоска.ТекстHTMLКанбанДоски();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КанбанДоскаПриНажатииНаСервере(Знач ИдентификаторЗадача, Знач ИдентификаторСтатуса)
	
	канбан_КанбанДоска.ИзменитьСтатусЗадаче(ИдентификаторЗадача, ИдентификаторСтатуса);
	
КонецПроцедуры

#КонецОбласти
