// @strict-types


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстHTMLКанбанДоскиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	События = Новый Массив; // Массив из Строка
	События.Добавить("ОбновитьКанбанДоскуHTML");
	
	канбан_КанбанДоскаКлиентПереопределяемый.СобытияОбработкиОповещения(События);
	
	ДопустимоеСобытие = События.Найти(ИмяСобытия);
	Если ДопустимоеСобытие <> Неопределено Тогда
		
		ТекстHTMLКанбанДоски();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Канбан доска при нажатии.
// 
// Параметры:
//  Элемент - ПолеФормы - Элемент
//  ДанныеСобытия - Структура:
//  * Button - Структура:
//  ** type - Строка
//  ** id - Строка
//  ** className - Строка
//  ** parentElement - Структура:
//  *** id - Строка
//  *** parentElement - Структура:
//  **** id - Строка
//  * Element - Структура:
//  ** className - Строка
//      
//  СтандартнаяОбработка - Булево - Стандартная обработка
//
&НаКлиенте
Процедура КанбанДоскаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Кнопка = ДанныеСобытия.Button;
	
	Если ЗначениеЗаполнено(Кнопка) Тогда
		
		// Пропускаем обработку для быстрого фильтра проектов
		Если Кнопка.type = "INPUT" Тогда
			
			Возврат;
			
		ИначеЕсли Кнопка.id = "update_svg" Тогда
			
			СтандартнаяОбработка = Ложь;
			КанбанДоска = "";
			ПодключитьОбработчикОжидания("ТекстHTMLКанбанДоски", 0.1, Истина);
			
		ИначеЕсли Кнопка.id = "setup_svg" Тогда
			
			СтандартнаяОбработка = Ложь;
			ОткрытьФорму("Обработка.Канбан_Доска_HTML.Форма.НастройкиДоски");
			
		ИначеЕсли Не ПустаяСтрока(Кнопка.className) Тогда
			
			СписокКлассовКнопки = Кнопка.className;
			ОсновноеИмяКлассаКнопки = СтрРазделить(СписокКлассовКнопки, " ")[0];
			
			Если ОсновноеИмяКлассаКнопки = "changeStatus" Тогда
				
				СтандартнаяОбработка = Ложь;
				
				ИдентификаторЗадача = СтрЗаменить(Кнопка.parentElement.id, "task", "");
				ИдентификаторСтатуса = Кнопка.parentElement.parentElement.id;
				
				КанбанДоскаПриНажатииНаСервере(
					ИдентификаторЗадача, 
					ИдентификаторСтатуса);
				
				ОповеститьОбИзменении(ЗадачаСсылка);
				
			КонецЕсли
			
		КонецЕсли;
		
	ИначеЕсли СтрРазделить(ДанныеСобытия.Element.className, " ")[0] = "my_tasks" Тогда
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ТекстHTMLКанбанДоски()
	
	ТекстHTMLКанбанДоскиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТекстHTMLКанбанДоскиНаСервере()
	
	КанбанДоска = канбан_КанбанДоска.ТекстHTMLКанбанДоски();
	
КонецПроцедуры

// Канбан доска при нажатии на сервере.
// 
// Параметры:
//  ИдентификаторЗадача - Строка
//  ИдентификаторСтатуса - Строка
//
&НаСервере
Процедура КанбанДоскаПриНажатииНаСервере(Знач ИдентификаторЗадача, Знач ИдентификаторСтатуса)
	
	Отказ = Ложь;
	ЗадачаСсылка = канбан_КанбанДоска.ИзменитьСтатусЗадаче(ИдентификаторЗадача, ИдентификаторСтатуса, Отказ);
	
	Если Не Отказ Тогда
		ТекстHTMLКанбанДоскиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти