// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МакетСтраницаРедактора = Справочники.канбан_Задачи.ПолучитьМакет("РедакторЗадач");
	СтраницаHTMLРедактора = МакетСтраницаРедактора.ПолучитьТекст();
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ИмяПользователя = ТекущийПользователь.ПолноеНаименование();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницаHTMLРедактораПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ДанныеСобытия.Button.id = "exportTasks" Тогда
		
		// Запись текста содержания задачи в объект.
		Если Объект.Содержание <> ДанныеСобытия.Button.textContent Тогда
			
			Объект.Содержание = ДанныеСобытия.Button.textContent;
			Модифицированность = Истина;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтраницаHTMLРедактораДокументСформирован(Элемент)
	
	// Передаем текст содержания задачи на страницу.
	КнопкаИмпортаСодержанияЗадачи = Элементы.СтраницаHTMLРедактора.Документ.getElementById("importTasks");
	КнопкаИмпортаСодержанияЗадачи.textContent = Объект.Содержание;
	КнопкаИмпортаСодержанияЗадачи.name = ИмяПользователя;
	КнопкаИмпортаСодержанияЗадачи.click();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти