// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МакетСтраницаРедактора = Справочники.канбан_Задачи.ПолучитьМакет("РедакторЗадач");
	СтраницаHTMLРедактора = МакетСтраницаРедактора.ПолучитьТекст();
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ИмяПользователя = ТекущийПользователь.ПолноеНаименование();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СтраницаHTMLРедактораПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ДанныеСобытия.Button.id = "exportTasks" Тогда
		
		Объект.Содержание = ДанныеСобытия.Button.textContent;
		Записать();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтраницаHTMLРедактораДокументСформирован(Элемент)
	
	КнопкаИмпортаСодержанияЗадачи = Элементы.СтраницаHTMLРедактора.Документ.getElementById("importTasks");
	КнопкаИмпортаСодержанияЗадачи.textContent = Объект.Содержание;
	КнопкаИмпортаСодержанияЗадачи.name = ИмяПользователя;
	КнопкаИмпортаСодержанияЗадачи.click();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти