// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДвоичныеДанныеРедактора = Справочники.канбан_Задачи.ПолучитьМакет("РедакторЗадач");
	канбан_КанбанДоска.ЗагрузитьПриложение(ДвоичныеДанныеРедактора, СтраницаHTMLРедактора, УникальныйИдентификатор);
	
//	СтраницаHTMLРедактора = МакетСтраницаРедактора.ПолучитьТекст();
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ИмяПользователя = ТекущийПользователь.ПолноеНаименование();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницаHTMLРедактораПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СсылкаВЭлементеСтраницы = ДанныеСобытия.Href; // Строка
	Если ЗначениеЗаполнено(СсылкаВЭлементеСтраницы) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		СсылкаИБ = ПолучитьНавигационнуюСсылкуИнформационнойБазы();
		Если СтрНайти(СсылкаВЭлементеСтраницы, СсылкаИБ) Тогда
			
			ВнутренняяСсылка = СтрЗаменить(СсылкаВЭлементеСтраницы, СсылкаИБ, "");
			ВнутренняяСсылка = СтрЗаменить(ВнутренняяСсылка, "#", "");
			ПерейтиПоНавигационнойСсылке(ВнутренняяСсылка);
			
		Иначе
			
			ЗапуститьПриложение(СсылкаВЭлементеСтраницы);
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ДанныеСобытия.Button) И ДанныеСобытия.Button.id = "exportTasks" Тогда
		
		// Запись текста содержания задачи в объект.
		Если Объект.Содержание <> ДанныеСобытия.Button.textContent Тогда
			
			Объект.Содержание = ДанныеСобытия.Button.textContent;
			Модифицированность = Истина;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтраницаHTMLРедактораДокументСформирован(Элемент)
	
	// TODO убрать из кода 1С и перенести в js, в котором вызвать уже событие и нажать на клик.
	// Передаем текст содержания задачи на страницу.
	КнопкаИмпортаСодержанияЗадачи = Элементы.СтраницаHTMLРедактора.Документ.getElementById("importTasks");
	Если КнопкаИмпортаСодержанияЗадачи <> Неопределено Тогда
		КнопкаИмпортаСодержанияЗадачи.textContent = Объект.Содержание;
		КнопкаИмпортаСодержанияЗадачи.name = ИмяПользователя;
		КнопкаИмпортаСодержанияЗадачи.click();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти