// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить текст HTML.
// 
// Возвращаемое значение:
//  Строка
//
Функция ТекстHTMLКанбанДоски() Экспорт
	
	ДанныеДляДоски = канбан_КанбанДоска.ДанныеДляКанбанДоски();
	
	Если ДанныеДляДоски.Статусы.Количество() = 0 Тогда
		
		МакетСтраницаРекламы = ПолучитьМакет("ШаблонПустаяДоска");
		Результат = МакетСтраницаРекламы.ПолучитьТекст();
		
		Возврат Результат;
		
	КонецЕсли;
	
	МакетСтраницаРекламы = ПолучитьМакет("ШаблонКанбанДоскиHTML");
	ДокументHTML = МакетСтраницаРекламы.ПолучитьДокументHTML();
	
	ИдентификаторПользователя = Строка(Пользователи.ТекущийПользователь().УникальныйИдентификатор());
	УзелТолькоМоиЗадачи = ДокументHTML.ПолучитьЭлементПоИдентификатору("my_tasks");
	УзелТолькоМоиЗадачи.УстановитьАтрибут("class", СтрШаблон("my_tasks user%1", ИдентификаторПользователя));
	
	УзелЧекбоксы = ДокументHTML.ПолучитьЭлементПоИдентификатору("checkboxes");
	
	ПроектыДоски = ДанныеДляДоски.Проекты;
	Для Каждого ДанныеПроекта Из ПроектыДоски Цикл
		
		УзелЧекбоксПроект = ДокументHTML.СоздатьЭлемент("div");
		УзелЧекбоксПроект.УстановитьАтрибут("class", "checkbox");
		
		ИД_Проекта = СтрШаблон("project%1", ДанныеПроекта.ИдентификаторПроектаСтрока);
		
		//Input
		УзелИнпутЧекбокса = ДокументHTML.СоздатьЭлемент("input");
		УзелИнпутЧекбокса.УстановитьАтрибут("type", "checkbox");
		УзелИнпутЧекбокса.УстановитьАтрибут("id", ИД_Проекта);
		УзелИнпутЧекбокса.УстановитьАтрибут("checked", "true");
		УзелИнпутЧекбокса.УстановитьАтрибут("onclick", "checkFluency(id, id)");
		УзелЧекбоксПроект.ДобавитьДочерний(УзелИнпутЧекбокса);
		
		//Label
		УзелЛейблЧекбокса = ДокументHTML.СоздатьЭлемент("label");
		УзелЛейблЧекбокса.УстановитьАтрибут("for", ИД_Проекта);
			
			//Вложенный div
			УзелЧекбоксИмя = ДокументHTML.СоздатьЭлемент("div");
			УзелЧекбоксИмя.УстановитьАтрибут("class", СтрШаблон("tag %1", ИД_Проекта));
			
			Если Не ПустаяСтрока(ДанныеПроекта.Цвет) Тогда
				УзелЧекбоксИмя.УстановитьАтрибут("style", СтрШаблон("background-color: rgb(%1);", ДанныеПроекта.Цвет));
			КонецЕсли;
			
			УзелЧекбоксИмя.ТекстовоеСодержимое = Строка(ДанныеПроекта.ПредставлениеПроекта);
			УзелЛейблЧекбокса.ДобавитьДочерний(УзелЧекбоксИмя);
		
		УзелЧекбоксПроект.ДобавитьДочерний(УзелЛейблЧекбокса);
		
		УзелЧекбоксы.ДобавитьДочерний(УзелЧекбоксПроект);
		
	КонецЦикла;
	
	УзелДоска = ДокументHTML.ПолучитьЭлементПоИдентификатору("kanban-board");
	
	// Узел для фиксированной шапки статусов задач
	УзелКанбанХедер = ДокументHTML.СоздатьЭлемент("div");
	УзелКанбанХедер.УстановитьАтрибут("class", "kanban_header");
	
	// Узел для самих задач внутри статусов доски
	УзелКанбанТело = ДокументHTML.СоздатьЭлемент("div");
	УзелКанбанТело.УстановитьАтрибут("class", "kanban_body");
	
	Для Каждого ДанныеСтатуса Из ДанныеДляДоски.Статусы Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Статус", ДанныеСтатуса.СтатусЗадачи);
		ЗадачиСоСтатусом = ДанныеДляДоски.ЗадачиИСтатусы.НайтиСтроки(ПараметрыОтбора);
		
		УзелБлокХедера = ДокументHTML.СоздатьЭлемент("div");
		УзелБлокХедера.УстановитьАтрибут("class", "block_header");
		
		// Наименование статуса
		УзелРазделаИмяСтатуса = ДокументHTML.СоздатьЭлемент("strong");
		УзелРазделаИмяСтатуса.УстановитьАтрибут("class", "kanban-block__name");
		УзелРазделаИмяСтатуса.ТекстовоеСодержимое = СтрШаблон("%1", ДанныеСтатуса.Представление);
		УзелБлокХедера.ДобавитьДочерний(УзелРазделаИмяСтатуса);
		
		// Количество задач
		УзелРазделаКоличествоЗадач = ДокументHTML.СоздатьЭлемент("strong");
		УзелРазделаКоличествоЗадач.УстановитьАтрибут("class", "kanban-block__number");
		УзелРазделаКоличествоЗадач.ТекстовоеСодержимое = СтрШаблон("%1", Строка(ЗадачиСоСтатусом.Количество()));
		УзелБлокХедера.ДобавитьДочерний(УзелРазделаКоличествоЗадач);
		
		#Область КнопкаДобавитьЗадачу
		
		// Блок кнопки добавления задачи
		УзелСсылкаЗадача = ДокументHTML.СоздатьЭлемент("a");
		УзелСсылкаЗадача.УстановитьАтрибут("href", "#");
		УзелСсылкаЗадача.УстановитьАтрибут("class", "add_task");
		
		УзелСсылкаСВГ = ДокументHTML.СоздатьЭлемент("svg");
		УзелСсылкаСВГ.УстановитьАтрибут("viewBox", "0 0 24 24");
		УзелСсылкаСВГ.УстановитьАтрибут("xmlns", "http://www.w3.org/2000/svg");
		
		УзелСсылкаPath = ДокументHTML.СоздатьЭлемент("path");
		УзелСсылкаPath.УстановитьАтрибут("d", "M12 4V20M4 12H20");
		УзелСсылкаPath.УстановитьАтрибут("stroke", "rgb(121, 121, 121)");
		УзелСсылкаPath.УстановитьАтрибут("stroke-width", "2");
		УзелСсылкаPath.УстановитьАтрибут("stroke-linecap", "round");
		
		УзелСсылкаСВГ.ДобавитьДочерний(УзелСсылкаPath);
		УзелСсылкаЗадача.ДобавитьДочерний(УзелСсылкаСВГ);
		УзелБлокХедера.ДобавитьДочерний(УзелСсылкаЗадача);
		
		#КонецОбласти
		
		УзелКанбанХедер.ДобавитьДочерний(УзелБлокХедера);
		
		УзелРазделаСтатуса = ДокументHTML.СоздатьЭлемент("div");
		УзелРазделаСтатуса.УстановитьАтрибут("class", "kanban-block");
		УзелРазделаСтатуса.УстановитьАтрибут("id", ДанныеСтатуса.УникальныйИдентификатор);
		УзелРазделаСтатуса.УстановитьАтрибут("ondragover", "allowDrop(event)");
		УзелКанбанТело.ДобавитьДочерний(УзелРазделаСтатуса);
		
		Для Каждого Задача Из ЗадачиСоСтатусом Цикл
			
			ИД_Задачи = СтрШаблон("task%1", Задача.ИдентификаторЗадача);
			ИД_Проекта = СтрШаблон("project%1", Задача.ИдентификаторПроекта);
			ИД_Пользователя = 
				?(ПустаяСтрока(Задача.ИдентификаторПользователя), "", СтрШаблон("user%1", Задача.ИдентификаторПользователя));
			
			// Карточки
			УзелКарточка = ДокументHTML.СоздатьЭлемент("div");
			УзелКарточка.УстановитьАтрибут("class", СтрШаблон("card %1 %2", ИД_Проекта, ИД_Пользователя));
			
			// Цвет бордера карточки
//			УзелКарточка.УстановитьАтрибут("onmouseover", СтрШаблон("this.style.borderColor='rgb(%1)';", Задача.ЦветПроекта));
//			УзелКарточка.УстановитьАтрибут("onmouseout", "this.style.borderColor='#ebebeb';");
			
			УзелКарточка.УстановитьАтрибут("draggable", "true");
			УзелКарточка.УстановитьАтрибут("ondragstart", "drag(event)");
			УзелКарточка.УстановитьАтрибут("id", ИД_Задачи);
			
			#Область ШапкаКарточки
			
			УзелШапкаКарточки = ДокументHTML.СоздатьЭлемент("div");
			УзелШапкаКарточки.УстановитьАтрибут("class", "card__header");
			
			УзелТэгКарточки = ДокументHTML.СоздатьЭлемент("div");
			УзелТэгКарточки.УстановитьАтрибут("class", "tag_task");
			УзелТэгКарточки.УстановитьАтрибут("style", СтрШаблон("background-color: rgb(%1);", Задача.ЦветПроекта));
			
			УзелШапкаКарточки.ДобавитьДочерний(УзелТэгКарточки);
			
			УзелШапкаКарточкиСсылка = ДокументHTML.СоздатьЭлемент("a");
			УзелШапкаКарточкиСсылка.УстановитьАтрибут("class", "card__link");
			УзелШапкаКарточкиСсылка.УстановитьАтрибут("href", Задача.НавигационнаяСсылка);
			УзелШапкаКарточкиСсылка.ТекстовоеСодержимое = СтрШаблон("Задача №%1", Задача.Код);
			
			УзелШапкаКарточки.ДобавитьДочерний(УзелШапкаКарточкиСсылка);
			
			УзелШапкаКарточкиИзображение = ДокументHTML.СоздатьЭлемент("img");
			УзелШапкаКарточкиИзображение.УстановитьАтрибут("class", "card__photo");
			УзелШапкаКарточкиИзображение.УстановитьАтрибут("alt", "foto");
			УзелШапкаКарточкиИзображение.УстановитьАтрибут("src", Задача.ФотографияИсполнителя);
			
			УзелШапкаКарточки.ДобавитьДочерний(УзелШапкаКарточкиИзображение);
			
			УзелКарточка.ДобавитьДочерний(УзелШапкаКарточки);
			
			#КонецОбласти
			
			#Область ТелоКарточки
			
			УзелТелоКарточки = ДокументHTML.СоздатьЭлемент("div");
			УзелТелоКарточки.УстановитьАтрибут("class", "card__text");
			
			УзелТелоКарточкиТекст = ДокументHTML.СоздатьЭлемент("span");
			УзелТелоКарточкиТекст.ТекстовоеСодержимое = Задача.Наименование;
			
			УзелТелоКарточки.ДобавитьДочерний(УзелТелоКарточкиТекст);
			УзелКарточка.ДобавитьДочерний(УзелТелоКарточки);
			
			#КонецОбласти
			
			УзелКнопкиОбновлениеСтатуса = ДокументHTML.СоздатьЭлемент("button");
			УзелКнопкиОбновлениеСтатуса.УстановитьАтрибут("class", СтрШаблон("changeStatus %1", ИД_Задачи));
			УзелКнопкиОбновлениеСтатуса.УстановитьАтрибут("style", "visibility: hidden;");
			
			УзелКарточка.ДобавитьДочерний(УзелКнопкиОбновлениеСтатуса);
			
			УзелРазделаСтатуса.ДобавитьДочерний(УзелКарточка);
			
		КонецЦикла;
	
	КонецЦикла;
	
	УзелДоска.ДобавитьДочерний(УзелКанбанХедер);
	УзелДоска.ДобавитьДочерний(УзелКанбанТело);
	
	Результат = ТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получает текст HTML из объекта ДокументHTML.
//
// Параметры:
//  ДокументHTML  - ДокументHTML - документ, из которого будет извлекаться текст.
//
// Возвращаемое значение:
//   Строка   - текст HTML
//
Функция ТекстHTMLИзОбъектаДокументHTML(Знач ДокументHTML)
	
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьHTML = Новый ЗаписьHTML;
	ЗаписьHTML.УстановитьСтроку();
	ЗаписьDOM.Записать(ДокументHTML, ЗаписьHTML);
	
	Возврат ЗаписьHTML.Закрыть();
	
КонецФункции

#КонецОбласти

#КонецЕсли
