// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Имя формы.
// 
// Параметры:
//  ИмяОпределяемогоТипа - Строка
// 
// Возвращаемое значение:
//  Строка - Имя формы
//
Функция ИмяФормыСпискаОпределяемогоТипа(ИмяОпределяемогоТипа) Экспорт
	
	ИмяФормыСписка = "";
	
	Тип = Метаданные.ОпределяемыеТипы[ИмяОпределяемогоТипа].Тип.Типы()[0];
	МетаданныеТипа = Метаданные.НайтиПоТипу(Тип);
	Если МетаданныеТипа <> Неопределено Тогда
		ПолноеИмяСправочника = МетаданныеТипа.ПолноеИмя();
	КонецЕсли;
	
	ИмяФормыСписка = СтрШаблон("%1.ФормаСписка", ПолноеИмяСправочника);
	
	Возврат ИмяФормыСписка;;
	
КонецФункции

#КонецОбласти